#โครงสร้างควบคุมแบบทำซ้ำ
# for loop มีจำนวนรอบที่ชัดเจน
#       (เริ่มต้น),(หยุด-1),(เพิ่มรอบ)
# range( start, stop-1, step) = เริ่มต้นจาก 0,1,2
# แต่สามารถระบุตำแหน่งเริ่มต้นได้ 

for i in range(5,10,2): # (ให้ทำงานรอบที่ 1 ก่อนถึงรอบที่ 6)มันจะหยุดทำงานก่อนถึงเลข 5 
    print("รอบที่ = ",i,"  Hello World")

'''
#การรวมค่า 
summation = 0
#                               (เขียนไว้ 100 แต่หยุดที่ 99นะ  )
for o in range(7,100,2): # เริ่มต้นที่ 7 , หยุดที่100 ลบ กับ 1, 2 คือเพิ่มรอบ
    summation += o
    print("รอบที่ = ",o,"sum = ",summation)

#หาค่าเฉลี่ย = ข้อมูลทั้งหมด หาร ด้วยจำนวนของข้อมูล
print (int(("ค่าเฉลี่ย = ",summation /int(99) )))

'''