import numpy as np

# Array 2D = Matrix
'''
เมตริกซ์จัตุรัส (Square Matrix) 
คือ จำนวนแถว และ คอลัมน์เท่ากัน

เมตริกซ์ศูนย์ ื(Zero Matrix)
คือ สมาชิกทุกตัวเป็น 0

เมตริกซ์เอกลักษณ์ (identity Matrix)
คือ สมาชิกเส้นทะแยงมุมมีค่าเป็น 1 ที่เหลือเป็น 0 
'''
# คำสั่งสร้าง array 1D ที่สมาชิกทุกตัวเป็น 0
X = np.zeros(5,dtype='int')
print('array 1D ที่สมาชิกทุกตัวเป็น 0:',X)
# คำสั่งสร้าง array 2D ที่สมาชิกทุกตัวเป็น 0
#           ((แถว,คอลัมน์))
X1 = np.zeros([3,3],dtype='int')
print('คำสั่งสร้าง array 2D ที่สมาชิกทุกตัวเป็น 0:',X1)


# คำสั่งสร้าง array 1D ที่สมาชิกทุกตัวเป็น 1
X2 = np.ones(5,dtype='int')
print('array 1D ที่สมาชิกทุกตัวเป็น 1',X2)
# คำสั่งสร้าง array 2D ที่สมาชิกทุกตัวเป็น 1
#         ([แถว,คอลัมน์])
X3 = np.ones([3,3],dtype='int')
print('array 2D ที่สมาชิกทุกตัวเป็น 1',X3)



# Matrix ค่าคงที่ (Full)
# 1D
# คำสั่งที่เราสามารถทำให้สมาชิกใน array เป็นเลขนั้นเลขเดียวทั้งหมด
X4 = np.full(3,6,dtype='int')
# (จำนวนสมาชิก,ตัวเลขที่เราอยากจะได้)
print(X4)
# 2D
X5 = np.full([3,2],7,dtype='int')
# ([แถว,คอลัมน์],ตัวเลขที่เราอยากจะได้)
print(X5)



# คำสั่ง identity,eye คือคำสั่งสร้างอาร์เรย์เป็นเมทริกซ์เอกษลักษ์  
# (สมาชิกเส้นทะแยงมุมมีค่าเป็น 1 ที่เหลือเป็น 0 ,สมาชิกเส้นแนวนอนหรือแนวตั้งมีค่าเป็น 1 ที่เหลือเป็น 0  )
# แบบ แถวกับคอลัมน์เท่ากัน
Array = np.identity(5)
print('Matrix identity = \n',Array)
# แบบ กำหนด แถวกับคอลัมน์ได้
Array = np.eye(3,4,k=1) # k = ย้ายมุมเลข 1
print('Matrix eye = \n',Array)


# คำสั่ง transpose  = ใช้สำหรับสลับ Matrix
Array = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print('อาร์เรย์ 2 มิติ แบบปกติ :\n',Array)
Array_trans = Array.transpose()
print('การสลับ Matrix Array 2D :\n',Array_trans)
# เช่น ถ้าเรามี 3แถว 4คอลัมน์ มันจะสลับไปเป็น 4แถว 3คอลัมน์


# คำสั่ง flatten ใช้สำหรับทำอาร์เรย์ให้เหลือ มิติเดียว
Array = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print('อาร์เรย์ 2 มิติ แบบปกติ :\n',Array)
Array_flat = Array.flatten()
print('อาร์เรย์ 2 มิติ ให้เป็น 1 มิติ :\n',Array_flat)


# สร้าง อาร์เรย์ 1 มิติ เราสารถระบุจำนวนช่วงของตัวเลขได้ และ จำนวนของสมาชิกหรือข้อมูล
# ด้วยคำสั่ง linspace
A = np.linspace(1,5,endpoint=False)
print(A)