Numlist = [1,2,3,4,5,6]
# เพิ่มค่าต่อท้าย ตัวแปล Numlist ด้วยคำสั่ง .append( ตัวเลขที่เราจะใส่ ) 
Numlist.append('ไม่ธรรมดา')
print('Numlist = ',Numlist)

# คำสั่งเช็คความยาว หรือ เช็คจำนวนข้อมูล ด้วยคำสั่ง len(ตัวแปล)
print('จำนวนข้อมูลของ Numlist:',len(Numlist))
# หรือ
X= len(Numlist)              #type = เช็คชนิดข้อมูล หรือ ประเภทข้อมูล 
print('จำนวนข้อมูลของ Numlist:',type(X),X)


# extend = ขยาย list หรือ ต่อ list 
X = ['ธรรมดา','ไม่ธรรมดา','น่าจะธรรมดา','จริงๆก็ธรรมดา','ไม่แน่ใจ','อืม....']
Y = [7,8,9,10,11,12]
# คำสั่ง .extend()     ตัวแปลข้างหน้า.extend(ตัวแปลที่จะต่อกับตัวแปลข้างหน้า)         ต่อ list / ต่อ Y เข้ากับ X 
X.extend(Y) # X ขึ้นต่อด้วย Y
print(X)



# remove = ลบข้อมูลในตัวแปล
x = [1,2,3,4,5]
# ลบข้อมูลในตัวแปล ตัวคำสั่ง ตัวแปล.remove(ข้อมูลที่จะลบในตัวแปล)
x.remove(1)
print(x)

# insert = คำสั่งแทรกข้อมูล
X1 = [1,2,3,4,5]
Y1 = [6,7,8,9,10]
Z1 = [11,12,13,14,15]
X1.insert(10,Z1)
print(X1)
Y1.insert(9,X1)
print(Y1)
# .pop() = คำสั่งที่ดึงขอมูลตัวสุดท้ายออกจาก list 
# แต่เราสามารถระบุได้ว่าจะดึงข้อมูลไหนออกจาก list ด้วย
# คำสั่ง .pop(ตำแหน่งข้อมูลที่จะดึง) ใช้สำหรับดึงข้อมูลออกจาก list อย่างถาวร
z = [1,2,3,4]
# วิธีเอาค่าออกจาก list หรือ z โดยใช้ pop
print("เอาค่า :",z.pop(3),"ออก")

# index = คืนลำดับ หรือ แสดง ตำแหน่งของข้อมูลในตัวแปล
x = [1,2,3,"Fir"]
y = x.index("Fir")
print('index[1] = ',y)


# count = ใช้สำหรับนับจำนวนข้อมูลที่ซ้ำกันว่ามีกี่ตัว
# count(ข้อมูลที่เราจะรับ) = นับจำนวนคำซ้ำในประโยคื หรือ คำที่ซ้ำกัน
Fruit = 'งงมาก ทำไม แลกเงินห้าบาท ได้แบงค์ร้อยมา ห้าใบ แบงค์ยี่สิบ ห้าใบ'
# คำสั่งนับคำ หรือ นับประโยคซ้ำ
print('ใบมีกี่ตัว :',Fruit.count('ใบ'))

n = [2,2,4,3,2,5,6,2]
y = n.count(2)
print('Count:',y)


# sort() = เรียงลำดับค่าภายใน list จาก น้อยไปมาก
x = [1,2,3,1,4,5,1]
x.sort()
print("Sort = ",x)


# reverse() = เรียงลำดับสุดท้าย ไปตำแหน่งเริ่มต้น
# หรือ เรียงลำดับจากหลังไปหน้า
x = [1,2,3,4,5] # เช่น 5,4,3,2,1
x.reverse()
print('Reverse : ',x)