
#Methods = Function ที่คนเขียน python สร้างไว้ให้สำหรับ object หลักๆ เช่น int,str,list,dict 
X = "GAME NA JAA"
# เปลี่ยนค่าจากตัว พิมพ์ใหญ่เป็นพิมพ์เล็ก
X.lower()
# เปลี่ยนค่าจากตัว พิมพ์เล็กเป็นพิมพ์ใหญ่
X.upper()

print("เปลี่ยน GAME NA JAA เป็น :",X.lower())

# หาตำแหน่ง M ว่าอยู่ตำแหน่งไหน Python เริ่มนับจาก 0
print ("M อยุ่ตำแหน่งที่ :",(X.find("M")))

# คำเว้นวรรคจะใส่ Single quote = (' ') หรือ Double quote = (" ") ให้
X.split() # splite = แยกคำ และเปลี่ยน เป็น list
print(X.split())

c = '     Teerapong Charoenram    '

# การปลดพื้นที่ด้างข้างทั้งสองข้าง หรือตัดพื้นที่ว่างด้านข้าง
c.strip() 
print("ปลดพื้นที่ด้างข้างทั้งสองข้าง :",c.strip())
# การปลดพื้นที่ด้านซ้าย หรือตัดพื้นที่ว่างด้านซ้าย
c.lstrip()
print("ปลดพื้นที่ด้านซ้าย :",c.lstrip())


# การปลดพื้นที่ด้านขวา หรือตัดพื้นที่ว่างด้านขวา
c.rstrip()
print("ปลดพื้นที่ด้านขวา :",c.rstrip())


z = [1,2,3,4]
# วิธีเอาค่าออกจาก list หรือ z โดยใช้ pop
print("เอาค่า :",z.pop(),"ออก")

# "".join() = เชื่อมประะโยคให้ติดกัน

