# โครสร้างควบคุมแบบทางเลือก
''' 
if expression(เงื่อนไขเป็นจริง): ( : = โคลลอน )
    statement(แสดงผล) เงื่อนไขของ if ต้องเป็นจริง(True) เท่านั้นถึงจะแสดงผล
else :
    statement(แสดงผล) เงื่อนไขของ if ต้องเป็นเท็จ(False) เท่านั้นถึงจะแสดงผล
'''
    
#กำหนดค่า
age = int(input("ป้อนอายุองคุณ : ")) 

# เปรียบเทียบ = Boolean

if age>=15 and age<=19:
    print("วัยรุ่น") #เงื่อนไขของ if ต้องเป็นจริงเท่านั้นถึงจะแสดงผล
elif age>=20 and age<=29:
    print("วัยผู้ใหญ่")
elif age>=30 and age<=50:
    print("วัยทำงาน")
else:
    print("วัยเด็ก") #เงื่อนไขของ if ต้องเป็นเท็จ(False) เท่านั้นถึงจะแสดงผล

#เอาค่า AND OR NOT มาเชื่อม

# ถ้าใช้ AND เป็นตัวดำเนินการ ถ้าค่าใดค่าหนึ่งเป็น False(เท็จ) จะตอบว่า False(เท็จ)
# ถ้าใช้ OR เป็นตัวดำเนินการ ถ้าค่าใดค่าหนึ่งเป็น True(จริง) จะตอบว่า True(จริง)

# NOT เป็นขั้วต้องข้ามกับ AND,OR
# ถ้า print (z) ออกมาว่าเป็น True(จริง) ถ้าอยากเปลี่ยนให้เป็น False(เท็จ) ให้เติม Not เช่น print(not z)
# ถ้า print (z) ออกมาว่าเป็น False(เท็จ) ถ้าอยากเปลี่ยนให้เป็น True(จริง) ให้เติม Not เช่น print(not z)