# โครงสร้างควบคุมแบบทำซ้ำ 
# จะทำซ้ำอยู่เรื่อยๆจนกว่าเงื่อนไขนั้นจะเป็นเท็จ

# while

'''
while expression(เงื่อนไข):
    statement(แสดงผล)

'''


i = 0 #ตัวนับจำนวน
while i<=10: # while ต้องเงื่อนไขเป็นจริงเท่านั้นถึงจะทำงาน เช่น 1<=3 หรือไม่ ถ้าใช่จะทำงาน ถ้าไม่ใช่จะจบการทำงาน
    print("วนรอบที่ = ",i)
    i =  i + 1 # เพิ่มจำนวนต่อรอบ เช่นถ้า i เรามีค่าเป็น 0 ถ้าจบรอบวนลูป มันจะเพิ่มมา 1 (หรือตามที่กำหนด)
    print("จบรอบ = ",i)

# การรวมเลข 7-100 , 1-100
num = 1 #กำหนดค่าเริ่มต้น
sum = 0 # กำหนดค่าผลลัพธ์
while num<=100: # ถ้า num น้อยกว่า 100 จะทำงาน 
    sum = num + sum # บวกค่า num = (1) กับ sum = (0) รวมกัน = 1
    num = num+1  # ถ้าบวก +1 เท่ากับ 1+2 = 3 หรือ 7+8 = 15 แต่ถ้าบวก +2 เท่ากับ  1+3 = 4  หรือ 7+9 = 16
print("รวมทั้งหมดเท่ากับ = ",sum)
# ถ้าเติม +1  มันจะบวกตามลำดับ  เช่น 1+2 = 3 , 3+3 = 6
# ถ้าเติม +2 มันจะข้ามตัวเลขไแหนึ่งช่อง เช่น 1+3 = 4 , 4+5 = 9 , 9+7 = 16

