# เจาะลึกกกก String 
Name = '   TeeraPong : 18   ' 
#ดึงข้อมูลในตัวแปล Name ด้วย index เริ่มนับที่ 0
print('ดึงข้อมูลจากตัวแปล Name:',Name[-14:]) 


# คำสั่ง บอกความยาวของตัวอัษรว่ามีกี่ตัวรวมถึงช่องว่าง = len() ใช้ได้เฉพาะ String
print('ความยาวของตัวแปล Name:',len(Name))


# คำสั่ง ลบช่องว่างทั้งซ้ายทั้งขวา
# ก่อน
print('ยังไม่ลบช่องว่าง:',Name)
#หลัง
print('ลบช่องว่างทั้งหมด:',Name.strip())


# คำสั่ง ลบช่องว่างด้านขวา
# ก่อน
print('ยังไม่ลบช่องว่าง:',Name)
#หลัง
print('ลบช่องว่างด้านขวา:',Name.rstrip())


# คำสั่ง ลบช่องว่างด้านซ้าย
# ก่อน
print('ยังไม่ลบช่องว่าง:',Name)
#หลัง
print('ลบช่องว่างด้านซ้าย:',Name.lstrip())

# เปลี่ยนค่าจากตัว พิมพ์ใหญ่เป็นพิมพ์เล็ก lower ทำให้ตัวแปล Name เป็นพิมพ์เล็กทั้งหมด
print('Lower ตัวแปล Name:',Name.lower())
# เปลี่ยนค่าจากตัว พิมพ์เล็กเป็นพิมพ์ใหญ่ upper ทำให้ตัวแปล Name เป็นพิมพ์ใหญ่ทั้งหมด
print('Upper ตัวแปล Name:',Name.upper())

# คำสั่งแปลงข้อความ ให้ตัวแรกเป็นพิมพ์ใหญ่ ที่เหลือเป็นพิมพ์เล็กทั้งหมด
print('ตัวแปล Name:',Name.capitalize())


name = 'Teerapong'
# คำสั่งแทนค่าในตัวแปล
# ก่อน
print('ก่อนแทนที่',name)
# หลัง
print(name.replace('Tee','Cha'))
#name.replace('ค่าเก่า','ค่าใหม่ที่จะแทนที่',ที่ของตัวเลขตัวอัษร)

# คำสั่งเช็คคำในตัวแปลข้อความในตัวแปล
name = 'Teerapong'
# คำสั่งแทนค่าในตัวแปล
# ก่อน
print('ก่อนแทนที่',name)
# หลัง
print(name.replace('Tee','Cha'))
#    name.replace('ค่าเก่า','ค่าใหม่ที่จะแทนที่',ที่ของตัวเลขตัวอัษร)

# คำสั่งเช็คคำในตัวแปล
X = 'pong' in name
print ('pong อยู่ในตัวแปล name หรือไม่:',X)
Y = 'Cha' in name
print ('Cha อยู่ในตัวแปล name หรือไม่:',Y)

#ถ้าเงื่อนไข X เป็นจริง
if X:
    # จะมีการแทนที่ในเงื่อนไข
    name = name.replace('pong','Cha')
print('หลังแทนที่:',name)