# รับค่าผ่านทางคีย์บอร์ด
# รับค่าข้อมูลโดยใช้ Function input
# เช่น input("กรุณาป้อนชื่อของท่าน : ")
print(input("กรุณาป้อนชื่อของท่าน : "))

# รับค่าที่ผู้ใช้ป้อนแล้วเก็บลงในตัวแปล  fName 

fName = input("กรุณาป้อนชื่อของท่าน : ")
LName = input("กรุณาป้อนนามสกุลของท่าน : ")
print("ชื่อของท่าน = ",(fName))
print("นามสกุลของท่าน = "+LName)

# เอาตัวแปลมาเรียงกันด้วยเครื่องหมาย (,)
print("คุณพิมพ์คำว่า = "+fName,LName)

#เช็คชนิดข้อมูล]
print(type(fName))


# การบวกเลขโดยการรับ input เข้ามา
# input
x = int(input("ป้อนตัวเลขตัวที่ 1 : "))
y = int(input("ป้อนตัวเลขตัวที่ 2 : "))

# process
z =int(x)+y

# output
print("x+y = ",z)
