# ตัวดำเดินการเปรียบเทียบ
#กฎ
# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ค่าที่นำมาเปรียบเทียบกันนั้นต้องเป็นข้อมูลชนิดเหมือนกัน
# คำตอบนั้นมีอยู่ 2 แบบ คือ True(จริง) / False(เท็จ)

x,y,z = 7, 5, 9

print("ค่า x มากกว่า y หรือไม่ ? = ", x>y)
print("ค่า x น้อยกว่า y หรือไม่ ? = ", x<y)
print("ค่า x เท่ากับ ค่า y หรือไม่ ? =",x==y   )
print("ค่า x ไม่เท่ากับ y หรือไม่ ? = ", x!=y)

# ถ้าใช้ หรือ ถ้าาค่าใดค่าหนึ่งเป็น  True(จริง) ก็จะตอบว่า True(จริง)
print("ค่า x มากกว่าหรือ เท่ากับ ค่า y หรือไม่ ? = ",x>=y)
print("ค่า x น้อยกว่าหรือ เท่ากับ ค่า y หรือไม่ ? = ",x<=y)


# เปรียบเทียบค่า 3 ค่า โดยใช่ และ / ถ้าใช้ และ  ถ้าค่าใดค่าหนึ่ง เป็น False(เท็จ) ก็จะตอบ False(เท็จ)
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ ? = ",x>y>x)
print("ค่า x น้อยกว่า y และ y น้อยกว่า z หรือไม่ ? = ",x>y>x)
# แต่ส่วนมากไม่ค่อยใช้อันนี้กัน