# ตัวดำเนินการทางตรรกศาสตร์
#คำตอบที่ได้ => True(จริง),False(เท็จ)

# ประกอบไปด้วย 3ตัวหลักๆ
# AND = และ
# OR = หรือ
#  NOT = ไม่,ไม่จริง


x = (20>30) # ค่า x = bool
y = (20==20) # ค่า y = bool

# ถ้าใช้ AND เป็นตัวดำเนินการ ถ้าค่าใดค่าหนึ่งเป็น False(เท็จ) จะตอบว่า False(เท็จ)
# ค่า z = (20>30) and (20==20)
z = x and y 
print(z)


# ถ้าใช้ OR เป็นตัวดำเนินการ ถ้าค่าใดค่าหนึ่งเป็น True(จริง) จะตอบว่า True(จริง)
# ค่า z = (20>30) and (20==20)
z1 = x or y 
print(z1)

# NOT เป็นขั้วต้องข้ามกับ AND,OR
# ถ้า print (z) ออกมาว่าเป็น True(จริง) ถ้าอยากเปลี่ยนให้เป็น False(เท็จ) ให้เติม Not เช่น print(not z)
# ถ้า print (z) ออกมาว่าเป็น False(เท็จ) ถ้าอยากเปลี่ยนให้เป็น True(จริง) ให้เติม Not เช่น print(not z)
print(not z)