# ลำดับความสำคัญของตัวดำเนินการทางคณิตศาสตร์

x = 5+2*10 # (2*10+5)
print(x)

x1 = (5+2)*10/2 # 5+2*10/2
print("ผลลัพธ์ x1 = ",x1)

x2 = (5+2)/(10*2) # 5+2 10*2  = 7/20
print("ผลลัพธ์ x2 = ",x2)

x3 = 5+2/10*2-5 # (2/10 = 0.2)(0.2*2 = 0.4)(5+0.4 = 5.4)(5.4-5 = 0.4) 
print("ผลลัพธ์ x3 = ",x3)

#ลำดับคามสำคัญของตัวดำเนินการ
# PEMDAS
# 1. P - Parentheses(วงเล็บ) = () ถ้าเจอวงเล็บ ให้ทำการหาค่าในวงเล็บก่อน ทำงานจากซ้ายไปขวา
# 2. E - Exponents(เลขยกกำลัง) = ** (ยกกำลัง)
# 3. MD - Multiplication or Division(การคูณหรือหาร) = *(คูณ), /(หาร), //(หารปัดเศษ), %(หารเอาเศษ) มีค่าเท่ากันให้ทำจากซ้าไปขวา
# 4. AS - Addition or Subtractin(บวกหรือลบ) = +(บวก), -(ลบ) มีค่าเท่ากันให้ทำจากซ้าไปขวา